app/Controllers/Admin.php

    public function pesanan()
    {
        $cekserver = $this->m_server->find(1);

        $data = [
            'pesan' => $this->m_pesanan->orderBy('no_faktur', 'desc')->findAll(),
            'client' => $cekserver['client_key']
        ];
---
SELECT *
FROM `server`
WHERE `server`.`id` = 1
SELECT *
FROM `pesanan`
ORDER BY `no_faktur` DESC