app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'customer'
 LIMIT 1
---
            session()->setFlashdata($sesserror);
            return redirect()->to('auth');
        } else {
            $login = $this->m_user->where('username', $username)->first();

INSERT INTO `users` (`username`, `telp`, `alamat`, `email`, `levels`, `password`) VALUES ('customer', '123456789012', 'batang', 'customer@gmail.com', 2, '$2y$10$egC.bS/dUVPLG7jCpy5H4.bgcD6gfbsPfUOno4CPisAhMfZNBETUK')
---
            return redirect()->back()->withInput();
        }
        $users = new m_user();
        $users->insert([
            'username' => $this->request->getVar('username'),
            'telp' => $this->request->getVar('telepon'),
            'alamat' => $this->request->getVar('alamat'),
            'email' => $this->request->getVar('email'),
            'levels' => 2,
            'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),



        ]);