app/Controllers/Transaksi.php

SELECT *
FROM `transaksi`
WHERE `customer` = 'customer'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `customer` = 'customer'
---
    public function histori()
    {
        $data = [
            'cart' => \Config\Services::cart(),


            'keranjang' => $this->m_transaksi->where('customer', session()->username)->paginate(10),