app/Models/m_home.php

    public function tot_produk()
    {
        return $this->db('madani')->table('produk')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `produk`

    public function tot_jual()
    {
        return $this->db('madani')->table('transaksi')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `transaksi`

    public function tot_kategori()
    {
        return $this->db('madani')->table('kategori')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `kategori`

    public function tot_pendapatan()
    {
        $builder = $this->db->table('keranjang');
        $builder->selectSum('total');
        $query = $builder->get();
---
SELECT SUM(`total`) AS `total`
FROM `keranjang`

    public function transaksi($tahun)
    {

        $builder = $this->db->table('keranjang');
        $builder->select('MONTH(transaction_time) bulan,sum(total)  total')->join('transaksi', 'transaksi.id_transaksi=keranjang.id_trx')->where('YEAR(transaction_time)', $tahun)->orderBy('MONTH(transaction_time)');
        $query = $builder->get();
---
SELECT MONTH(transaction_time) bulan, sum(total)  total
FROM `keranjang`
JOIN `transaksi` ON `transaksi`.`id_transaksi`=`keranjang`.`id_trx`
WHERE YEAR(transaction_time) = '2024'
ORDER BY MONTH(transaction_time)

    public function produk($tahun)
    {
        $builder = $this->db->table('keranjang');
        $builder->select('MONTH(transaction_time) bulan,count(qty) total')->join('transaksi', 'transaksi.id_transaksi=keranjang.id_trx')->where('YEAR(transaction_time)', $tahun)->orderBy('MONTH(transaction_time)');
        $query = $builder->get();
---
SELECT MONTH(transaction_time) bulan, count(qty) total
FROM `keranjang`
JOIN `transaksi` ON `transaksi`.`id_transaksi`=`keranjang`.`id_trx`
WHERE YEAR(transaction_time) = '2024'
ORDER BY MONTH(transaction_time)