app/Models/m_pesanan.php

    public function histori($id_transaksi)
    {
        return $this->where(['id_transaksi' => $id_transaksi])->first();
---
SELECT *
FROM `pesanan`
WHERE `id_transaksi` = '3'
 LIMIT 1

    public function cetak($id_transaksi)
    {
        $builder = $this->db->table('orders');
        $builder->join('pesanan', 'pesanan.id_transaksi=orders.id_pesan')->join('produk', 'produk.id_produk=orders.id_produk')->where('id_transaksi', $id_transaksi);
        $query = $builder->get();
---
SELECT *
FROM `orders`
JOIN `pesanan` ON `pesanan`.`id_transaksi`=`orders`.`id_pesan`
JOIN `produk` ON `produk`.`id_produk`=`orders`.`id_produk`
WHERE `id_transaksi` = '3'